УТ.РасширениеКонтурЛогистика/src/Catalogs/КонтурЛогистика_ПодразделенияДиадок/КонтурЛогистика_ПодразделенияДиадок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КонтурЛогистика_ПодразделенияДиадок</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <attributes>
    <name>ID</name>
    <comment>Идентификатор подразделения Диадок</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>43</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>IDВладелец</name>
    <comment>связь с организациями по КонтурЛогистика_ОрганизацииДиадок.OrgId</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>43</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>IDОсновное</name>
    <comment>Идентификатор основного подразделения Диадок</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>43</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>IDРодитель</name>
    <comment>Идентификатор родительского подразделения Диадок</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>43</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресApartment</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресBlock</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресBuilding</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресCity</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресLocality</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресRegion</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>2</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресStreet</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресTerritory</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресZipCode</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>6</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресПредставление</name>
    <comment>Текстовое представления адреса</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИнАдресAddress</name>
    <comment>Адрес иностранного подразделения</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИнАдресCountry</name>
    <comment>Страна иностранного подразделения</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КраткоеОбозначение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отключено</name>
    <comment>Признак IsDisabled в Диадок</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СвязанныеОбъекты</name>
    <attributes>
      <name>СвязанныйОбъект</name>
      <type>
        <types>CatalogRef.СтруктураПредприятия</types>
      </type>
    </attributes>
    <attributes>
      <name>УИД</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипЗначенияУИД</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УТ.РасширениеКонтурЛогистика/src/Catalogs/КонтурЛогистика_ПодразделенияДиадок/ObjectModule.bsl
Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	СформироватьпредставлениеАдреса();
	
	// Подключаемый модуль (ПМ)
	ПараметрыПМ = Новый Структура("ЭтотОбъект, Отказ", ЭтотОбъект, Отказ);
	КонтурЛогистика_ПодключаемыйМодульВызов.ОбработкаСобытияПодключаемогоМодуля("КонтурЛогистика_ПодразделенияДиадок_ПередЗаписью_После", Истина, ПараметрыПМ);
	
КонецПроцедуры

Процедура СформироватьпредставлениеАдреса()
	
	// TODO объединить с Организациями Диадок
	АдресПредставление = СокрЛП("" + АдресZipCode + " " + АдресRegion);
	
	Если ЗначениеЗаполнено(АдресTerritory) Тогда 
		АдресПредставление = АдресПредставление + ", " + АдресTerritory; 	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(АдресCity) Тогда 
		АдресПредставление = АдресПредставление + ", " + АдресCity; 	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(АдресLocality) Тогда 
		АдресПредставление = АдресПредставление + ", " + АдресLocality; 	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(АдресStreet) Тогда 
		АдресПредставление = АдресПредставление + ", " + АдресStreet; 	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(АдресBuilding) Тогда 
		АдресПредставление = АдресПредставление + ", " + АдресBuilding; 	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(АдресBlock) Тогда 
		АдресПредставление = АдресПредставление + ", " + АдресBlock; 	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(АдресApartment) Тогда 
		АдресПредставление = АдресПредставление + ", " + АдресApartment; 	
	КонецЕсли;

	Если ЗначениеЗаполнено(ИнАдресCountry) Тогда 
		АдресПредставление = АдресПредставление + ", " + ИнАдресCountry; 	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ИнАдресAddress) Тогда 
		АдресПредставление = АдресПредставление + ", " + ИнАдресAddress; 	
	КонецЕсли;
	
КонецПроцедуры
